Revit 2026 API

# AdaptiveComponentInstanceUtils Class

---

An interface for Adaptive Component Instances.

SystemObject Autodesk.Revit.DBAdaptiveComponentInstanceUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class AdaptiveComponentInstanceUtils
```
```vb
Public NotInheritable Class AdaptiveComponentInstanceUtils
```
```cpp
public ref class AdaptiveComponentInstanceUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type AdaptiveComponentInstanceUtils = class end
```

The AdaptiveComponentInstanceUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateAdaptiveComponentInstance | Creates a FamilyInstance of Adaptive Component Family. |
|  | GetInstancePlacementPointElementRefIds | Gets Placement Adaptive Point Element Ref ids to which the instance geometry adapts. |
|  | GetInstancePointElementRefIds | Gets Adaptive Point Element Ref ids to which the instance geometry adapts. |
|  | GetInstanceShapeHandlePointElementRefIds | Gets Shape Handle Adaptive Point Element Ref ids to which the instance geometry adapts. |
|  | HasAdaptiveFamilySymbol | Verifies if a FamilyInstance has an Adaptive Family Symbol. |
|  | IsAdaptiveComponentInstance | Verifies if a FamilyInstance is an Adaptive Component Instance. |
|  | IsAdaptiveFamilySymbol | Verifies if a FamilySymbol is a valid Adaptive Family Symbol. |
|  | IsInstanceFlipped | Gets the value of the flip parameter on the adaptive instance. |
|  | MoveAdaptiveComponentInstance | Moves Adaptive Component Instance by the specified transformation. |
|  | SetInstanceFlipped | Sets the value of the flip parameter on the adaptive instance. |

#### Reference

Autodesk.Revit.DB Namespace